tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1934_tdd.h
#define SSPM2                         522
#define SSPM3                         523
#define CKP                           524
#define SSPEN                         525
#define SSPOV                         526
#define WCOL                          527
#define SSPCON2                       528
#define SEN                           529
#define RSEN                          530
#define PEN                           531
#define RCEN                          532
#define ACKEN                         533
#define ACKDT                         534
#define ACKSTAT                       535
#define GCEN                          536
#define SSPCON3                       537
#define DHEN                          538
#define AHEN                          539
#define SBCDE                         540
#define SDAHT                         541
#define BOEN                          542
#define SCIE                          543
#define PCIE                          544
#define ACKTIM                        545
#define CCPR1L                        546
#define CCPR1H                        547
#define CCP1CON                       548
#define CCP1M0                        549
#define CCP1M                         550
#define CCP1M1                        551
#define CCP1M2                        552
#define CCP1M3                        553
#define DC1B                          554
#define DC1B0                         555
#define DC1B1                         556
#define P1M                           557
#define P1M0                          558
#define P1M1                          559
#define PWM1CON                       560
#define P1DC0                         561
#define P1DC1                         562
#define P1DC2                         563
#define P1DC3                         564
#define P1DC4                         565
#define P1DC5                         566
#define P1DC6                         567
#define P1RSEN                        568
#define CCP1AS                        569
#define PSS1BD0                       570
#define PSS1BD1                       571
#define PSS1AC0                       572
#define PSS1AC1                       573
#define CCP1AS0                       574
#define CCP1AS1                       575
#define CCP1AS2                       576
#define CCP1ASE                       577
#define PSTR1CON                      578
#define STR1A                         579
#define STR1B                         580
#define STR1C                         581
#define STR1D                         582
#define STR1SYNC                      583
#define CCPR2L                        584
#define CCPR2H                        585
#define CCP2CON                       586
#define CCP2M                         587
#define CCP2M0                        588
#define CCP2M1                        589
#define CCP2M2                        590
#define CCP2M3                        591
#define DC2B                          592
#define DC2B0                         593
#define DC2B1                         594
#define P2M                           595
#define P2M0                          596
#define P2M1                          597
#define PWM2CON                       598
#define P2DC0                         599
#define P2DC1                         600
#define P2DC2                         601
#define P2DC3                         602
#define P2DC4                         603
#define P2DC5                         604
#define P2DC6                         605
#define P2RSEN                        606
#define CCP2AS                        607
#define PSS2BD0                       608
#define PSS2BD1                       609
#define PSS2AC0                       610
#define PSS2AC1                       611
#define CCP2AS0                       612
#define CCP2AS1                       613
#define CCP2AS2                       614
#define CCP2ASE                       615
#define PSTR2CON                      616
#define STR2A                         617
#define STR2B                         618
#define STR2C                         619
#define STR2D                         620
#define STR2SYNC                      621
#define CCPTMRS0                      622
#define C1TSEL0                       623
#define C1TSEL                        624
#define C1TSEL1                       625
#define C2TSEL0                       626
#define C2TSEL                        627
#define C2TSEL1                       628
#define C3TSEL0                       629
#define C3TSEL                        630
#define C3TSEL1                       631
#define C4TSEL                        632
#define C4TSEL0                       633
#define C4TSEL1                       634
#define CCPTMRS1                      635
#define C5TSEL                        636
#define C5TSEL0                       637
#define C5TSEL1                       638
#define CCPR3L                        639
#define CCPR3H                        640
#define CCP3CON                       641
#define CCP3M0                        642
#define CCP3M1                        643
#define CCP3M2                        644
#define CCP3M3                        645
#define DC3B0                         646
#define DC3B1                         647
#define P3M0                          648
#define P3M1                          649
#define PWM3CON                       650
#define P3DC0                         651
#define P3DC1                         652
#define P3DC2                         653
#define P3DC3                         654
#define P3DC4                         655
#define P3DC5                         656
#define P3DC6                         657
#define P3RSEN                        658
#define CCP3AS                        659
#define PSS3BD0                       660
#define PSS3BD1                       661
#define PSS3AC0                       662
#define PSS3AC1                       663
#define CCP3AS0                       664
#define CCP3AS1                       665
#define CCP3AS2                       666
#define CCP3ASE                       667
#define PSTR3CON                      668
#define STR3A                         669
#define STR3B                         670
#define STR3C                         671
#define STR3D                         672
#define STR3SYNC                      673
#define CCPR4L                        674
#define CCPR4H                        675
#define CCP4CON                       676
#define CCP4M0                        677
#define CCP4M1                        678
#define CCP4M2                        679
#define CCP4M3                        680
#define DC4B0                         681
#define DC4B1                         682
#define CCPR5L                        683
#define CCPR5H                        684
#define CCP5CON                       685
#define CCP5M0                        686
#define CCP5M1                        687
#define CCP5M2                        688
#define CCP5M3                        689
#define DC5B0                         690
#define DC5B1                         691
#define IOCBP                         692
#define IOCBP0                        693
#define IOCBP1                        694
#define IOCBP2                        695
#define IOCBP3                        696
#define IOCBP4                        697
#define IOCBP5                        698
#define IOCBP6                        699
#define IOCBP7                        700
#define IOCBN0                        701
#define IOCBN                         702
#define IOCBN1                        703
#define IOCBN2                        704
#define IOCBN3                        705
#define IOCBN4                        706
#define IOCBN5                        707
#define IOCBN6                        708
#define IOCBN7                        709
#define IOCBF0                        710
#define IOCBF                         711
#define IOCBF1                        712
#define IOCBF2                        713
#define IOCBF3                        714
#define IOCBF4                        715
#define IOCBF5                        716
#define IOCBF6                        717
#define IOCBF7                        718
#define TMR4                          719
#define PR4                           720
#define T4CON                         721
#define T4CKPS0                       722
#define T4CKPS                        723
#define T4CKPS1                       724
#define TMR4ON                        725
#define T4OUTPS                       726
#define T4OUTPS0                      727
#define T4OUTPS1                      728
#define T4OUTPS2                      729
#define T4OUTPS3                      730
#define TMR6                          731
#define PR6                           732
#define T6CON                         733
#define T6CKPS0                       734
#define T6CKPS                        735
#define T6CKPS1                       736
#define TMR6ON                        737
#define T6OUTPS0                      738
#define T6OUTPS                       739
#define T6OUTPS1                      740
#define T6OUTPS2                      741
#define T6OUTPS3                      742
#define LCDCON                        743
#define LMUX0                         744
#define LMUX                          745
#define LMUX1                         746
#define CS                            747
#define CS0                           748
#define CS1                           749
#define WERR                          750
#define SLPEN                         751
#define LCDEN                         752
#define LCDPS                         753
#define LP                            754
#define LP0                           755
#define LP1                           756
#define LP2                           757
#define LP3                           758
#define WA                            759
#define LCDA                          760
#define BIASMD                        761
#define WFT                           762
#define LCDREF                        763
#define VLCD1PE                       764
#define VLCD2PE                       765
#define VLCD3PE                       766
#define LCDIRI                        767
#define LCDIRS                        768
#define LCDIRE                        769
#define LCDCST0                       770
#define LCDCST                        771
#define LCDCST1                       772
#define LCDCST2                       773
#define LCDRL                         774
#define LRLAT0                        775
#define LRLAT                         776
#define LRLAT1                        777
#define LRLAT2                        778
#define LRLBP                         779
#define LRLBP0                        780
#define LRLBP1                        781
#define LRLAP0                        782
#define LRLAP                         783
#define LRLAP1                        784
#define LCDSE0                        785
#define SE0                           786
#define SE1                           787
#define SE2                           788
#define SE3                           789
#define SE4                           790
#define SE5                           791
#define SE6                           792
#define SE7                           793
#define LCDSE1                        794
#define SE8                           795
#define SE9                           796
#define SE10                          797
#define SE11                          798
#define SE12                          799
#define SE13                          800
#define SE14                          801
#define SE15                          802
#define LCDSE2                        803
#define SE16                          804
#define SE17                          805
#define SE18                          806
#define SE19                          807
#define SE20                          808
#define SE21                          809
#define SE22                          810
#define SE23                          811
#define LCDDATA0                      812
#define SEG0COM0                      813
#define SEG1COM0                      814
#define SEG2COM0                      815
#define SEG3COM0                      816
#define SEG4COM0                      817
#define SEG5COM0                      818
#define SEG6COM0                      819
#define SEG7COM0                      820
#define LCDDATA1                      821
#define SEG8COM0                      822
#define SEG9COM0                      823
#define SEG10COM0                     824
#define SEG11COM0                     825
#define SEG12COM0                     826
#define SEG13COM0                     827
#define SEG14COM0                     828
#define SEG15COM0                     829
#define LCDDATA2                      830
#define SEG16COM0                     831
#define SEG17COM0                     832
#define SEG18COM0                     833
#define SEG19COM0                     834
#define SEG20COM0                     835
#define SEG21COM0                     836
#define SEG22COM0                     837
#define SEG23COM0                     838
#define LCDDATA3                      839
#define SEG0COM1                      840
#define SEG1COM1                      841
#define SEG2COM1                      842
#define SEG3COM1                      843
#define SEG4COM1                      844
#define SEG5COM1                      845
#define SEG6COM1                      846
#define SEG7COM1                      847
#define LCDDATA4                      848
#define SEG8COM1                      849
#define SEG9COM1                      850
#define SEG10COM1                     851
#define SEG11COM1                     852
#define SEG12COM1                     853
#define SEG13COM1                     854
#define SEG14COM1                     855
#define SEG15COM1                     856
#define LCDDATA5                      857
#define SEG16COM1                     858
#define SEG17COM1                     859
#define SEG18COM1                     860
#define SEG19COM1                     861
#define SEG20COM1                     862
#define SEG21COM1                     863
#define SEG22COM1                     864
#define SEG23COM1                     865
#define LCDDATA6                      866
#define SEG0COM2                      867
#define SEG1COM2                      868
#define SEG2COM2                      869
#define SEG3COM2                      870
#define SEG4COM2                      871
#define SEG5COM2                      872
#define SEG6COM2                      873
#define SEG7COM2                      874
#define LCDDATA7                      875
#define SEG8COM2                      876
#define SEG9COM2                      877
#define SEG10COM2                     878
#define SEG11COM2                     879
#define SEG12COM2                     880
#define SEG13COM2                     881
#define SEG14COM2                     882
#define SEG15COM2                     883
#define LCDDATA8                      884
#define SEG16COM2                     885
#define SEG17COM2                     886
#define SEG18COM2                     887
#define SEG19COM2                     888
#define SEG20COM2                     889
#define SEG21COM2                     890
#define SEG22COM2                     891
#define SEG23COM2                     892
#define LCDDATA9                      893
#define SEG0COM3                      894
#define SEG1COM3                      895
#define SEG2COM3                      896
#define SEG3COM3                      897
#define SEG4COM3                      898
#define SEG5COM3                      899
#define SEG6COM3                      900
#define SEG7COM3                      901
#define LCDDATA10                     902
#define SEG8COM3                      903
#define SEG9COM3                      904
#define SEG10COM3                     905
#define SEG11COM3                     906
#define SEG12COM3                     907
#define SEG13COM3                     908
#define SEG14COM3                     909
#define SEG15COM3                     910
#define LCDDATA11                     911
#define SEG16COM3                     912
#define SEG17COM3                     913
#define SEG18COM3                     914
#define SEG19COM3                     915
#define SEG20COM3                     916
#define SEG21COM3                     917
#define SEG22COM3                     918
#define SEG23COM3                     919
#define STATUS_SHAD                   920
#define C_SHAD                        921
#define DC_SHAD                       922
#define Z_SHAD                        923
#define WREG_SHAD                     924
#define BSR_SHAD                      925
#define PCLATH_SHAD                   926
#define FSR0L_SHAD                    927
#define FSR0H_SHAD                    928
#define FSR1L_SHAD                    929
#define FSR1H_SHAD                    930
#define STKPTR                        931
#define TOSL                          932
#define TOSH                          933

#endif // _PIC16LF1934_H_
